{
Даны переменные A, B, C. 
Изменить их значения, переместив содержимое
 A в B, B — в C, C — в A, и вывести новые значения переменных A, B, C. 
}
var a,b,c:integer;
begin
Read(a,b,c);
Write('старые хначения',' ',a,' ',b,' ',c );
end.